# Find passengers on board for each bus.

* Source 1: https://stackoverflow.com/questions/69475572/sql-join-query-two-tables
* Source 2: https://stackoverflow.com/questions/68885664/sql-to-find-all-passengers-boarding-a-bus

For each bus, return the number of passengers boarding it. Just two columns: the bus id and passengers on board.

In [1]:
%load_ext sql
%sql postgresql://fknight:@localhost/postgres

In [2]:
%%html
<style>
table {float:left}
</style>

## The `buses` table

In [3]:
%%sql
DROP TABLE IF EXISTS buses;
CREATE TABLE buses (
  id INT,
  origin VARCHAR(20),
  destination VARCHAR(20),
  tmofday TIME
);

INSERT INTO buses 
VALUES 
    (10, 'Warsaw', 'Berlin', '10:55'),
    (20, 'Berlin', 'Paris',  '06:20'),
    (21, 'Berlin', 'Paris',  '14:00'),
    (22, 'Berlin', 'Paris',  '21:40'),
    (30, 'Paris',  'Madrid', '13:30');

SELECT * FROM buses;

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
5 rows affected.
5 rows affected.

[(10, 'Warsaw', 'Berlin', datetime.time(10, 55)),
 (20, 'Berlin', 'Paris', datetime.time(6, 20)),
 (21, 'Berlin', 'Paris', datetime.time(14, 0)),
 (22, 'Berlin', 'Paris', datetime.time(21, 40)),
 (30, 'Paris', 'Madrid', datetime.time(13, 30))]

## The `passengers` table

In [4]:
%%sql

DROP TABLE IF EXISTS passengers;
CREATE TABLE passengers (
  id int,
  origin varchar(20),
  destination varchar(20),
  tmofday time
);

INSERT INTO passengers 
VALUES 
    ( 1, 'Paris',  'Madrid', '13:30'),
    ( 2, 'Paris',  'Madrid', '13:31'),
    (10, 'Warsaw', 'Paris',  '10:00'), 
    (11, 'Warsaw', 'Berlin', '22:31'),
    (40, 'Berlin', 'Paris',  '06:15'),
    (41, 'Berlin', 'Paris',  '06:50'),
    (42, 'Berlin', 'Paris',  '07:12'),
    (43, 'Berlin', 'Paris',  '12:03'),
    (44, 'Berlin', 'Paris',  '20:00');
    
SELECT * FROM passengers;

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
9 rows affected.
9 rows affected.

[(1, 'Paris', 'Madrid', datetime.time(13, 30)),
 (2, 'Paris', 'Madrid', datetime.time(13, 31)),
 (10, 'Warsaw', 'Paris', datetime.time(10, 0)),
 (11, 'Warsaw', 'Berlin', datetime.time(22, 31)),
 (40, 'Berlin', 'Paris', datetime.time(6, 15)),
 (41, 'Berlin', 'Paris', datetime.time(6, 50)),
 (42, 'Berlin', 'Paris', datetime.time(7, 12)),
 (43, 'Berlin', 'Paris', datetime.time(12, 3)),
 (44, 'Berlin', 'Paris', datetime.time(20, 0))]

## The expected output:

| id | passengers_on_board |
|--- |---                  |
| 10 | 0                   |
| 20 | 1                   |
| 21 | 3                   |
| 22 | 1                   |
| 30 | 1                   |

# Type your SQL below

In [7]:
# %%sql
#
# Type your query here